import datetime
dict = {"русский язык":4,
        "математика":5,
        "литература":3,
        "история":5,
        "химия":3,
        "физика":5,
        "биология":3,
        "английский язык":3,
        "обществознание":4,
        "география":4,
        "физкультура":3,
        "информатика":5,
        "обж":5,
        "история России":5}
actor_info = ("Денверн","Пайл",1920,5,11)
samara = ['Максим Сергеев',
 'Владимир Петров',
 'Андрей Кузнецов',
 'Александр Петров',
 'Андрей Сергеев',
 'Александр Кузнецов',
 'Сергей Петров',
 'Иван Кузнецов',
 'Иван Иванов',
 'Андрей Иванов',
 'Александр Иванов',
 'Алексей Сергеев',
 'Максим Иванов',
 'Алексей Иванов',
 'Сергей Сергеев',
 'Сергей Иванов',
 'Алексей Петров',
 'Дмитрий Кузнецов',
 'Максим Кузнецов',
 'Владимир Иванов',
 'Дмитрий Петров',
 'Иван Сергеев',
 'Александр Сергеев',
 'Иван Петров',
 'Дмитрий Сергеев',
 'Андрей Петров',
 'Владимир Сергеев',
 'Дмитрий Иванов',
 'Сергей Кузнецов',
 'Максим Петров'
                 ]

tamanduas = "ленивый кабан"
imperator = "Сы Се"

# /////////////////////////////////////////////////////////////////////////////////


# Задание 1
print('Задание 1')
average_mark = sum(dict.values())/len(dict)
print("Cредняя оценка аттестата",average_mark)
print('-----------------------------------------------------------------------------------------')

# Задание 2
print('Задание 2')
uniq_names = []
for people in samara:
    name = people[:people.find(' ')]
    if name not in uniq_names:
        uniq_names.append(name)
print(uniq_names)
print('-----------------------------------------------------------------------------------------')

# Задание 3
print('Задание 3')
res = 0
for classes in dict:
        res += len(classes)
print("Cумма букв всех предметов:",res)
print('-----------------------------------------------------------------------------------------')

# Задание 4
print('Задание 4')
uniq_symbols = []
for classes in dict.keys():
    for symb in classes:
        if symb not in uniq_symbols:
            uniq_symbols.append(symb)
str_uniq_symbols = ", ".join(uniq_symbols)
print ("Уникальные буквы в названиях предметов:", str_uniq_symbols)
print('-----------------------------------------------------------------------------------------')

# Задание 5
print('Задание 5')
bint = ''
for symb in tamanduas:
        bint +=(format(ord(symb), '08b'))
print("Имя моего домашнего тамандуа в бинарном виде:", bint)
print('-----------------------------------------------------------------------------------------')

# Задание 6
print('Задание 6')
birthday_date = datetime.date(actor_info[2],actor_info[3],actor_info[4])
print("Количество дней от даты рождения", str(actor_info[0]), str(actor_info[1])+"а" + ":", datetime.date.today()-birthday_date)
print('-----------------------------------------------------------------------------------------')

# Задание 7
print('Задание 7')
materials = []
print("Для завершения записи материалов напишите <<Закончить>>")
while True:
    material = input("Введите название материала:")
    if (material == "Закончить"):
        print("Ваши материалы:")
        for i in range(0,len(materials)):
            print(materials[i])
        break
    else:
        materials.append(material)
print('-------------------------------------------------------------------------------------------------------------------------')        

# Задание 8 
print('Задание 8')
num = input("Введите номер, имя которого хотите заменить на имя императора:")
if int(num) > len(samara):
    print("Ваше число слишком большое, введите число до", len(samara))
    num = input("Введите номер, имя которого хотите заменить на имя императора:")
samara[int(num)-1] = imperator
print("Новый список имен:",samara)
print('-------------------------------------------------------------------------------------------------------------------------')

# Задание 9
print('Задание 9')
towns = ["Крутая", "Засосная", "Синие Лепяги", "Добрые челы", "Мусорка", "Факфак", "Синегубово", "Дно", "Жабино", "Хреновое"]
linked_list = {towns[i]: towns[i+1] for i in range(len(towns)-1)}
linked_list[towns[-1]] = None
print("Изначальный связный список:",linked_list)
sel_town = input("Введите название города, который хотите удалить:")
if sel_town in towns:
    towns.remove(sel_town)
    linked_list = {towns[i]: towns[i + 1] for i in range(len(towns) - 1)}
    linked_list[towns[-1]] = None
else:
    print("Названия вашего города нет в списке")
print("Связный список с выкинутым словом:",linked_list)
sel_key = input("Введите название города, который хотите заменить на <<Конец>>:")
if sel_key in linked_list.keys():
    for key, value in linked_list.items():
        if value == sel_key:
            linked_list[key] = "Конец"
else:
    print("Названия вашего города нет в списке")
print("Связный список с вставленным словом <<Конец>>:",linked_list)