


#исходные данные

#1) предметы в школьном аттестате (не меньше 14), как словарь (dictionary) из названия и оценки (можно выдумать)

attest = {"Русский язык" : 4,
          "Литература" : 4,
          "Алгебра" : 5,
          "Геометрия" : 4,
          "Физика" : 4,
          "Химия" : 4,
          "География" : 4,
          "История" : 5,
          "Обществознание" : 5,
          "ОБЖ" : 4,
          "Иностранный язык" : 4,
          "Физическая культура" : 4,
          "ИЗО" : 4,
          "Технология" : 5}

#2) полное имя с фамилией и дату рождения любого актера из вестерна 1960х годов как кортеж (tuple);

western = {"Чак", "Норрис", "10.03.1940"}

#3) список (list) из имени и фамилии, составленные случайно по таблице из самых популярных (с сайта http://topnamesinrussia.tilda.ws), свой город взять по номеру равному дню в месяце вашего рождения,длина списка не меньше 30 элементов (имя + фамилия);

# №1 - Москва

name = ["Иван",
        "Александр",
        "Сергей",
        "Андрей",
        "Дмитрий",
        "Алексей",
        "Максим",
        "Михаил",
        "Владимир"
        "Никита"
       ]
surname = ["Иванов",
          "Петров",
          "Смирнов",
          "Сергеев",
          "Волков",
          "Кузнецов",
          "Васильев",
          "Романов"
          ]
#4) имя из прилагательного и существительного, которое вы бы дали своему домашнему тамандуа (строка).
creature = "Dirty Harry"

#Работа

#1) вывести среднюю оценку в аттестате;

